{
  "articulos": [
    {
      "title": "Introducción",
      "body": "<h2 style=\"text-align:center;\">Esta entrada es la introducción.</h2><p style=\"text-align:center;\">Actualmente todas los articulos estan con estado <code>Completado</code> a excepción de este articulo que se encuentra <code>Pendiente</code>.</p><p style=\"text-align:center;\">Arriba a la derecha podrás modificar el estado de cada articulo y ese cambio se guardaraá de manera automatica.</p><p style=\"text-align:center;\">Intentá cambiar este articulo a <code>Completado</code> para completar la lista y llevarte una sorpresa.🎉</p><p style=\"text-align:center;\">Por último, recuerde guardar los cambios.</p>",
      "status": "pendiente",
      "id": "5c5a"
    },
    {
      "title": "Palabras",
      "body": "<p>Lo que sigue de aquí es solo un montón de palabras que se copiaron y pegaron y escribieron a modo de relleno para usar este el complemento en sí. Incluye todos los elementos tipográficos sensibles que podría pensar, como <strong>texto en negrita</strong>, listas desordenadas, ordenadas listas, bloques de código, comillas en bloque, <i>e incluso cursivas</i>.</p><p>Es importante cubrir todos estos casos de uso por algunas razones:</p><ol><li>Queremos que todo se vea bien desde el primer momento.</li><li>Realmente solo la primera razón, ese es el objetivo del complemento.</li><li>Aquí hay una tercera razón ficticia, aunque una lista con tres elementos parece más realista que una lista con dos elementos.</li></ol><p>Ahora vamos a probar otro estilo de encabezado.</p>",
      "status": "completado",
      "id": "2c39"
    },
    {
      "title": "Que se vea bien",
      "body": "<h3>Debemos asegurarnos de que se vea bien.</h3><p>A veces tienes encabezados directamente uno debajo del otro. En esos casos Ud. a menudo tiene que deshacer el margen superior en el segundo encabezado porque generalmente se ve mejor que los encabezados estén más juntos que un párrafo seguido por un encabezado debe ser.</p><h3>Cuando un encabezado viene después de un párrafo...</h3><p>Cuando un encabezado viene después de un párrafo, necesitamos un poco más de espacio, como yo ya mencionado anteriormente. Ahora veamos cómo se vería una lista más compleja como.</p><p><strong>A menudo hago esto donde los elementos de la lista tienen encabezados.</strong></p><p>Por alguna razón, creo que esto se ve genial, lo cual es desafortunado porque es bastante molesto para obtener los estilos correctos.</p><p>A menudo también tengo dos o tres párrafos en estos elementos de la lista, por lo que lo difícil parte es obtener el espacio entre los párrafos, el encabezado del elemento de la lista y Separe los elementos de la lista para que todos tengan sentido. Bastante difícil honestamente, podrías argumenta con fuerza que no deberías escribir de esta manera.</p><p><strong>Dado que esta es una lista, necesito al menos dos elementos.</strong></p><p>Ya expliqué lo que estoy haciendo en el elemento de la lista anterior, pero una lista no sería una lista si solo tuviera un elemento, y realmente queremos que esto parecer realista. Es por eso que agregué este segundo elemento de la lista, así que en realidad tener algo que mirar al escribir los estilos.</p>",
      "status": "completado",
      "id": "a58b"
    },
    {
      "title": "Imagen",
      "body": "<figure class=\"image\"><img style=\"aspect-ratio:1024/1024;\" src=\"https://res.cloudinary.com/srcouto/image/upload/v1712143795/B_ahgdh3.png\" width=\"1024\" height=\"1024\"></figure><figure class=\"image\"><img style=\"aspect-ratio:1024/1024;\" src=\"https://res.cloudinary.com/srcouto/image/upload/v1712143796/U_npxvhh.png\" width=\"1024\" height=\"1024\"></figure><figure class=\"image\"><img style=\"aspect-ratio:1024/1024;\" src=\"https://res.cloudinary.com/srcouto/image/upload/v1712143800/A_tyqk1e.png\" width=\"1024\" height=\"1024\"></figure>",
      "status": "completado",
      "id": "7cf6"
    },
    {
      "title": "Articulo Tailwind Prose",
      "body": "<p>Hasta ahora, tratar de diseñar un artículo, documento o publicación de blog con Tailwind ha sido una tarea tediosa que requería un buen ojo para la tipografía y mucho CSS personalizado complejo.</p><p>De forma predeterminada, Tailwind elimina todo el estilo predeterminado del navegador de párrafos, encabezados, listas y más. Esto termina siendo realmente útil para crear interfaces de usuario de aplicaciones porque dedica menos tiempo a deshacer los estilos de agente de usuario, pero cuando <i>realmente</i> solo se está tratando de diseñar algún contenido que proviene de un editor de texto enriquecido en un CMS o un archivo de descuento, puede ser sorprendente y poco intuitivo.</p><p>De hecho, recibimos muchas quejas al respecto, y la gente nos pregunta regularmente cosas como:</p><blockquote><p>¿Por qué Tailwind elimina los estilos predeterminados en mis elementos h1? ¿Cómo deshabilito esto? ¿Qué quieres decir con que pierdo todos los otros estilos base? ¿también?</p></blockquote><p>Te escuchamos, pero no estamos convencidos de que simplemente deshabilitar nuestros estilos base sea lo que realmente quieres. No querrá tener que eliminar los molestos márgenes cada vez que usa un elemento p en una parte de la interfaz de usuario de su tablero. Y yo Dudo que realmente quieras que las publicaciones de tu blog usen los estilos de agente de usuario: quieres que se vean <i>impresionantes</i>, no horribles.</p><p>Agrega una nueva clase prose que puede colocar en cualquier bloque de contenido HTML estándar y conviértalo en un documento hermoso y bien formateado:</p><p>El <strong>complemento </strong><i>@tailwindcss/typography</i> es nuestro intento de brindarle lo que <i>realmente</i> quieres, sin ninguna de las desventajas de deshabilitar nuestros estilos base.</p><figure class=\"image image_resized\"><img style=\"aspect-ratio:1000/667;\" src=\"https://images.unsplash.com/photo-1556740758-90de374c12ad?ixlib=rb-1.2.1&amp;ixid=eyJhcHBfaWQiOjEyMDd9&amp;auto=format&amp;fit=crop&amp;w=1000&amp;q=80\" alt=\"\" width=\"1000\" height=\"667\"></figure><p>Para obtener más información sobre cómo usar el complemento y las funciones que incluye, <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://github.com/tailwindcss/typography/blob/master/README.md\">leer la documentación</a>.</p><p>&lt;article class=\"prose\"&gt; &nbsp;&lt;h1&gt;Garlic bread with cheese: What the science tells us&lt;/h1&gt; &nbsp;&lt;p&gt; &nbsp; &nbsp;For years parents have espoused the health benefits of eating garlic bread with cheese to their &nbsp; &nbsp;children, with the food earning such an iconic status in our culture that kids will often dress &nbsp; &nbsp;up as warm, cheesy loaf for Halloween. &nbsp;&lt;/p&gt; &nbsp;&lt;p&gt; &nbsp; &nbsp;But a recent study shows that the celebrated appetizer may be linked to a series of rabies cases &nbsp; &nbsp;springing up around the country. &nbsp;&lt;/p&gt; &nbsp;&lt;!-- ... --&gt; &lt;/article&gt;</p><p>For more information about how to use the plugin and the features it includes, <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://github.com/tailwindcss/typography/blob/master/README.md\"><strong>read the documentation</strong></a>.</p><h2>Qué esperar de aquí en adelante</h2><p>Lo que sigue de aquí es solo un montón de palabras he escrito a modo de relleno para usar este el complemento en sí. Incluye todos los elementos tipográficos sensibles que podría pensar, como <strong>texto en negrita</strong>, listas desordenadas, ordenadas listas, bloques de código, comillas en bloque, <i>e incluso cursivas</i>.</p><p>Es importante cubrir todos estos casos de uso por algunas razones:</p><ol><li>Queremos que todo se vea bien desde el primer momento.</li><li>Realmente solo la primera razón, ese es el objetivo del complemento.</li><li>Aquí hay una tercera razón ficticia, aunque una lista con tres elementos parece más realista que una lista con dos elementos.</li></ol><p>Ahora vamos a probar otro estilo de encabezado.</p><h3>La tipografía debe ser fácil</h3><p>Ese es un encabezado para usted, con un poco de suerte si hemos hecho nuestro trabajo correctamente. eso se verá bastante razonable.</p><p>Algo que un sabio me dijo una vez sobre la tipografía es:</p><blockquote><p>La tipografía es muy importante si no quieres que tus cosas se vean como basura. Hazlo bien, entonces no será malo.</p></blockquote><p>Probablemente también sea importante que las imágenes se vean bien aquí por defecto, pero en este caso aún no he logrado implementarlas. Pero te aseguro que se verán bien cuando funcione.</p><p>Ahora les voy a mostrar un ejemplo de una lista desordenada para asegurarse de que se ve bien, también:</p><ul><li>Así que aquí está el primer elemento de esta lista.</li><li>En este ejemplo, mantenemos los elementos cortos.</li><li>Más tarde, usaremos elementos de lista más largos y complejos.</li></ul><p>Y ese es el final de esta sección.</p><h2>¿Qué pasa si apilamos encabezados?</h2><h3>También debemos asegurarnos de que se vea bien.</h3><p>A veces tienes encabezados directamente uno debajo del otro. En esos casos Ud. a menudo tiene que deshacer el margen superior en el segundo encabezado porque generalmente se ve mejor que los encabezados estén más juntos que un párrafo seguido por un encabezado debe ser.</p><h3>Cuando un encabezado viene después de un párrafo...</h3><p>Cuando un encabezado viene después de un párrafo, necesitamos un poco más de espacio, como yo ya mencionado anteriormente. Ahora veamos cómo se vería una lista más compleja como.</p><p><strong>A menudo hago esto donde los elementos de la lista tienen encabezados.</strong></p><p>Por alguna razón, creo que esto se ve genial, lo cual es desafortunado porque es bastante molesto para obtener los estilos correctos.</p><p>A menudo también tengo dos o tres párrafos en estos elementos de la lista, por lo que lo difícil parte es obtener el espacio entre los párrafos, el encabezado del elemento de la lista y Separe los elementos de la lista para que todos tengan sentido. Bastante difícil honestamente, podrías argumenta con fuerza que no deberías escribir de esta manera.</p><p><strong>Dado que esta es una lista, necesito al menos dos elementos.</strong></p><p>Ya expliqué lo que estoy haciendo en el elemento de la lista anterior, pero una lista no sería una lista si solo tuviera un elemento, y realmente queremos que esto parecer realista. Es por eso que agregué este segundo elemento de la lista, así que en realidad tener algo que mirar al escribir los estilos.</p><p><strong>Tampoco es una mala idea agregar un tercer elemento.</strong></p><p>Creo que probablemente hubiera estado bien usar solo dos elementos, pero tres es definitivamente no es peor, y dado que parece que no tengo problemas para hacer las paces cosas arbitrarias para escribir, también podría incluirlo.</p><p>Después de este tipo de lista, generalmente tengo una declaración o párrafo de cierre, porque parece un poco extraño saltar directamente a un encabezado.</p><h3>¿Qué sucede con las listas anidadas?</h3><p>Las listas anidadas básicamente siempre se ven mal, por eso los editores como <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://medium.com/\">Medium</a> no lo hacen. incluso dejarte hacerlo, pero supongo que como algunos de ustedes lo harán tenemos que llevar la carga de al menos hacer que funcione.</p><ol><li><strong>Las listas anidadas rara vez son una buena idea.</strong><ul><li>Puede sentir que está siendo realmente \"organizado\" o algo así, pero simplemente está creando una forma gruesa en la pantalla que es difícil de leer.</li><li>La navegación anidada en las interfaces de usuario también es una mala idea, mantenga las cosas tan planas como sea posible. posible.</li><li>Anidar toneladas de carpetas en su código fuente tampoco es útil.</li></ul></li><li><strong>Ya que necesitamos más elementos, aquí hay otro.</strong><ul><li>No estoy seguro de si nos molestaremos en diseñar más de dos niveles de profundidad.</li><li>Dos ya es demasiado, tres es una mala idea.</li><li>Si anida cuatro niveles de profundidad, pertenece a la prisión.</li></ul></li><li><strong>Dos elementos no es realmente una lista, aunque tres es bueno.</strong><ul><li>Una vez más, no anide las listas si quiere que la gente realmente lea su contenido.</li><li>Nadie quiere ver esto.</li><li>Estoy molesto porque incluso tenemos que molestarnos en diseñar esto.</li></ul></li></ol><p>Lo más molesto de las listas en Markdown es que Los elementos &lt;li&gt; no reciben un hijo etiqueta &lt;p&gt; a menos que haya varios párrafos en la lista artículo. Eso significa que también tengo que preocuparme por diseñar esa molesta situación.</p><p><strong>Por ejemplo, aquí hay otra lista anidada.</strong></p><p>Pero esta vez con un segundo párrafo.</p><ul><li>Estos elementos de la lista no tendrán etiquetas &lt;p&gt;</li><li>Porque son solo una línea cada uno</li></ul><p><strong>Pero en este segundo elemento de la lista de nivel superior, lo harán.</strong></p><p>Esto es especialmente molesto debido al espacio en este párrafo.</p><p>Como puede ver aquí, debido a que agregué una segunda línea, este elemento de la lista ahora tiene una etiqueta &lt;p&gt;.</p><p>Esta es la segunda línea de la que estoy hablando por cierto.</p><p>Finalmente, aquí hay otro elemento de la lista, por lo que es más como una lista.</p><p>Un elemento de lista de cierre, pero sin lista anidada, porque ¿por qué no?</p><p>Y finalmente una frase para cerrar esta sección.</p><h2>Hay otros elementos que necesitamos diseñar</h2><p>Casi me olvido de mencionar enlaces, como <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://tailwindcss.com\">este enlace al sitio web de Tailwind CSS</a>. Casi los hicimos azules, pero eso fue ayer, así que elegimos gris oscuro, se siente más nervioso.</p><p>Incluso incluimos estilos de tabla, échale un vistazo:</p><figure class=\"table\"><table><thead><tr><th colspan=\"1\" rowspan=\"1\"><p>Wrestler</p></th><th colspan=\"1\" rowspan=\"1\"><p>Origin</p></th><th colspan=\"1\" rowspan=\"1\"><p>Finisher</p></th></tr></thead><tbody><tr><td colspan=\"1\" rowspan=\"1\"><p>Bret \"The Hitman\" Hart</p></td><td colspan=\"1\" rowspan=\"1\"><p>Calgary, AB</p></td><td colspan=\"1\" rowspan=\"1\"><p>Sharpshooter</p></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><p>Stone Cold Steve Austin</p></td><td colspan=\"1\" rowspan=\"1\"><p>Austin, TX</p></td><td colspan=\"1\" rowspan=\"1\"><p>Stone Cold Stunner</p></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><p>Randy Savage</p></td><td colspan=\"1\" rowspan=\"1\"><p>Sarasota, FL</p></td><td colspan=\"1\" rowspan=\"1\"><p>Elbow Drop</p></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><p>Vader</p></td><td colspan=\"1\" rowspan=\"1\"><p>Boulder, CO</p></td><td colspan=\"1\" rowspan=\"1\"><p>Vader Bomb</p></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><p>Razor Ramon</p></td><td colspan=\"1\" rowspan=\"1\"><p>Chuluota, FL</p></td><td colspan=\"1\" rowspan=\"1\"><p>Razor's Edge</p></td></tr></tbody></table></figure><p>También debemos asegurarnos de que el código en línea se vea bien, como si quisiera hablar sobre los elementos &lt;span&gt; o contarle las buenas noticias sobre @tailwindcss/tipografía.</p><h3>A veces incluso uso code en los encabezados</h3><p>Aunque probablemente sea una mala idea, e históricamente he tenido dificultades haciendo que se vea bien. Este truco de <i>\"envolver los bloques de código en acentos graves\"</i> funciona bastante bien aunque realmente.</p><p>Aún no hemos usado un h4</p><p>Pero ahora tenemos. No utilice h5 o h6 en su contenido, <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://medium.com/\">Medium</a> solo admite dos niveles de encabezado por una razón, animales. Y honestamente consideré usar un pseudo-elemento before para gritarle a usted si usa un h5 o h6.</p><p>No los diseñamos en absoluto porque los elementos h4 son ya son tan pequeños que tienen el mismo tamaño que el cuerpo del texto. Que somos se supone que tiene que ver con un h5, hacerlo <i>más pequeño</i> que el cuerpo ¿Copiar? No, gracias.</p><h3>Todavía tenemos que pensar en encabezados apilados.</h3><p>Asegurémonos de no estropearlo con los elementos h4 tampoco.</p><p>Uf, con un poco de suerte hemos diseñado los encabezados sobre este texto y se ven bastante bien.</p><p>Agreguemos un párrafo de cierre aquí para que las cosas terminen con un bloque de tamaño decente de texto. No puedo explicar por qué quiero que las cosas terminen de esa manera, pero tengo que asumir que es porque creo que las cosas se verán raras o desequilibradas si hay un encabezado demasiado cerca del final del documento.</p><p>Lo que he escrito aquí es probablemente lo suficientemente largo, pero agregando esta oración final no puede lastimar.</p><h2><strong>Code should look okay by default.</strong></h2><p>I think most people are going to use <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://highlightjs.org/\"><strong>highlight.js</strong></a> or <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://prismjs.com/\"><strong>Prism</strong></a> or something if they want to style their code blocks but it wouldn't hurt to make them look <i>okay</i> out of the box, even with no syntax highlighting.</p><p>Here's what a default tailwind.config.js file looks like at the time of writing:</p><p>module.exports = { &nbsp;purge: [], &nbsp;theme: { &nbsp; &nbsp;extend: {}, &nbsp;}, &nbsp;variants: {}, &nbsp;plugins: [], }</p><p>&nbsp;</p>",
      "status": "completado",
      "id": "f43e"
    },
    {
      "title": "Código tambien",
      "body": "<pre><code class=\"language-html\">&lt;HoverCard v-if=\"editor_title === ''\"&gt;\n  &lt;HoverCardTrigger&gt;\n    &lt;TriangleAlert class=\"size-5\" /&gt;\n  &lt;/HoverCardTrigger&gt;\n  &lt;HoverCardContent\n    class=\"w-40 text-sm text-center bg-background ring-secondary ring-1\"\n    :align=\"'start'\"\n    side=\"bottom\"\n  &gt;\n    &lt;p\n      class=\"py-1 font-mono text-balance\"\n      v-if=\"editor_title === ''\"\n    &gt;\n      Articulo sin título\n    &lt;/p&gt;\n  &lt;/HoverCardContent&gt;\n&lt;/HoverCard&gt;</code></pre><p>&nbsp;</p>",
      "status": "completado",
      "id": "a021"
    }
  ]
}